src/cf/Логистика/src/Documents/ПриходныйОрдер/ПриходныйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйОрдер</name>
  <registerRecords>AccumulationRegister.ТоварыКПоступлениюНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/Логистика/src/Documents/ПриходныйОрдер/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
// Получает таблицу по товарам для проведения.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПриходныйОрдер - Ссылка на документ.
//
// Возвращаемое значение:
//  Структура - Структура с таблицами для проведения.
//
Функция ПолучитьТаблицыДвижений(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка.Дата КАК Период,
	|	ТаблицаТовары.Ссылка.ДокументОснование КАК Документ,
	|	ТаблицаТовары.Ссылка.Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|	ПриходныйОрдер.Выполнен
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Документ.ПриходныйОрдер.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдер КАК ПриходныйОрдер
	|		ПО ТаблицаТовары.Ссылка = ПриходныйОрдер.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументСсылка
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Ссылка.Дата,
	|	ТаблицаТовары.Ссылка.ДокументОснование,
	|	ТаблицаТовары.Ссылка.Склад,
	|	ТаблицаТовары.Номенклатура,
	|	ПриходныйОрдер.Выполнен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Период,
	|	Значение(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	втДанные.Документ,
	|	втДанные.Склад,
	|	втДанные.Номенклатура,
	|	втДанные.Количество
	|ИЗ
	|	втДанные КАК втДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Период,
	|	Значение(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	втДанные.Склад,
	|	втДанные.Номенклатура,
	|	втДанные.Количество
	|ИЗ
	|	втДанные КАК втДанные
	|ГДЕ
	|	втДанные.Выполнен";
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	РезультатПакет = Запрос.ВыполнитьПакет();
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ТаблицаТоварыКПоступлениюНаСклад", РезультатПакет[1].Выгрузить());
	СтруктураОтвет.Вставить("ТаблицаТоварыНаСкладах", РезультатПакет[2].Выгрузить());
	Возврат СтруктураОтвет;
КонецФункции
#КонецОбласти

#КонецЕсли
